---
kind: type
id: T:Autodesk.Revit.DB.WallSweepInfo
source: html/140876fa-4c17-ad27-8a12-a4bf755e06f3.htm
---
# Autodesk.Revit.DB.WallSweepInfo

Represents a wall sweep or reveal of a vertically compound structure.

## Syntax (C#)
```csharp
public class WallSweepInfo : IDisposable
```